In [27]:
import pandas as pd
import sqlite3
from sqlalchemy import create_engine

In [28]:
pd.set_option('display.float_format', '{:,.2f}'.format)

In [29]:
# Load dataset into a DataFrame
df = pd.read_csv(r'C:\Users\User\Desktop\Projects\SQL\Healthcare & Hospital Management\Dataset\amazon_sales_analysis.csv')

In [30]:
# Replace with your PostgreSQL credentials
user = 'postgres'
password = ' ' 
host = 'localhost'  
port = '5432'       
database = 'amazon'

# Create connection string
engine = create_engine(f'postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}')

In [31]:
#1.Retrieve all columns for the first 10 orders.
query = """
SELECT * FROM amazon 
LIMIT 10;
"""
df = pd.read_sql(query, engine)
print(df)

   order_id customer_id       customer_name  gender  age  \
0  532b3f3e    90101340        Wayne Harris    Male   20
1  dee15a50    d9098344        Melissa Long    Male   40
2  07bd779e    be9e8d15    Christine Guzman    Male   43
3  f52cb099    bf06c8a5       Veronica Bass    Male   61
4  8d2d3abc    850dfded        Jason Cannon    Male   44
5  5099dfc9    744735d3  Michelle Dominguez    Male   52
6  fc01e1a7    c9567f43     Danielle Warren   Other   23
7  23051fa8    2e2d6989      Felicia Vaughn   Other   56
8  25fe645f    8635d9ce      Michelle Wells    Male   65
9  402f4077    4e272219           Sean West  Female   64

                             email                city           state  \
0             jose55@stevenson.com          East Shawn         Georgia
1                jacob94@jones.com  New Williamborough         Wyoming
2                qstewart@ross.com          Port Devon        Nebraska
3  russellstephen@santos-watts.com   South Rhondamouth        Colorado
4     holly52@johnson-campbell.com          Port Sarah        Colorado
5          bakerashley@hotmail.com    New Michelleberg        Illinois
6          adamsdavid@villegas.com          West April  South Carolina
7      melissawashington@yahoo.com          Frankshire      New Mexico
8              zmoreno@hotmail.com         North Jason      New Jersey
9        sheiladaniels@hotmail.com            Khanland            Utah

  country product_id product_name        category         sub_category  price  \
0     USA   ab3431c6  Non-Fiction           Books  Non-Fiction Model 8 318.44
1     USA   59bc1024      Perfume          Beauty      Perfume Model 1  47.67
2     USA   d7fea14e      T-Shirt        Clothing      T-Shirt Model 8  57.54
3     USA   5bca2d89      T-Shirt        Clothing      T-Shirt Model 8 938.48
4     USA   56ff47e7    Biography           Books    Biography Model 4 942.32
5     USA   8d2ca5bc   Face Cream          Beauty   Face Cream Model 7 413.76
6     USA   49d64d94        Shoes        Clothing        Shoes Model 6 716.49
7     USA   e2d94ddf      Blender  Home & Kitchen      Blender Model 7 470.79
8     USA   d3a7aee6        Jeans        Clothing        Jeans Model 5 856.32
9     USA   68de836d       Laptop     Electronics       Laptop Model 1 240.84

   quantity  order_date delivery_date    payment_method  rating
0         4  2024-08-26    2023-12-30        Debit Card       5
1         4  2025-03-05    2024-04-04       Credit Card       3
2         1  2024-01-26    2025-01-07        Debit Card       1
3         4  2023-12-05    2024-06-10        Debit Card       2
4         1  2025-02-26    2024-08-26  Cash on Delivery       2
5         4  2023-04-21    2023-05-09       Credit Card       4
6         2  2024-10-16    2024-05-07       Net Banking       1
7         1  2023-12-06    2023-05-18  Cash on Delivery       4
8         3  2024-10-09    2023-06-26  Cash on Delivery       5
9         1  2024-06-13    2024-08-23       Credit Card       3

In [32]:
# 2.Find the total number of orders placed.
query = """
SELECT COUNT(order_id) AS total_orders FROM amazon;
"""
df = pd.read_sql(query, engine)
print(df)

   total_orders
0          1000

In [33]:
# 3.List all unique payment methods used.
query = """
SELECT DISTINCT payment_method FROM amazon;
"""
df = pd.read_sql(query, engine)
print(df)

     payment_method
0               UPI
1       Net Banking
2        Debit Card
3  Cash on Delivery
4       Credit Card

In [34]:
# 4.Find the total quantity of products sold.
query = """
SELECT SUM(quantity) AS TOTAL_PRODUCT_SOLD FROM amazon;
"""
df = pd.read_sql(query, engine)
print(df)

   total_product_sold
0                2974

In [35]:
# 5.Show all orders where the customer is from 'California’.
query = """
SELECT * FROM amazon
WHERE state = 'California';
"""
df = pd.read_sql(query, engine)
print(df)

    order_id customer_id     customer_name  gender  age  \
0   09279b3c    c40eab35     Randy Escobar    Male   40
1   fb4ec46f    d2e184ac      Susan Wagner   Other   34
2   7d969e6d    ccb336d8       Mark Taylor   Other   37
3   638818d9    d4ac9dad      James Murray    Male   57
4   39b9d79a    1ede72fa    Thomas Jimenez  Female   23
5   894da403    9b33ee63       Paul Tucker    Male   33
6   5d2bfb12    1ed92525      James Romero   Other   47
7   2aa16dd2    76bf5628     Ronald Martin   Other   24
8   1f482732    71ecdc4f     Ryan Castillo    Male   23
9   e6fb283c    166f0261        Kim Morgan   Other   28
10  de97c10d    eb5b9dcd  Travis Blackwell    Male   31
11  f7f12405    58d0cdf3      Arthur Smith    Male   20
12  167fcd30    bdf2bc3d      Hailey Knapp   Other   45

                            email                 city       state country  \
0      margaretthompson@yahoo.com  South Martinchester  California     USA
1           shanejacobs@yahoo.com           Lake Tyler  California     USA
2       brandistewart@delgado.biz           Lake Jamie  California     USA
3             drobinson@yahoo.com     Lake Christopher  California     USA
4   ucontreras@hopkins-waters.com         Victoriafort  California     USA
5          myersjames@hotmail.com             Lisaberg  California     USA
6                 lcain@haney.com    East Kimberlyland  California     USA
7            hornkyle@kennedy.com            Debraview  California     USA
8          trevinojason@yahoo.com           East Scott  California     USA
9             gbarker@garrett.com          Port Andrea  California     USA
10             halljoel@yahoo.com             Lisaberg  California     USA
11          victorterry@yahoo.com            Hayesview  California     USA
12             lclark@hotmail.com        West Patricia  California     USA

   product_id product_name        category       sub_category  price  \
0    3c4ce0c1      Sweater        Clothing    Sweater Model 5 555.51
1    8cde2e1f      Shampoo          Beauty   Shampoo Model 10 671.69
2    533abb5b      Toaster  Home & Kitchen    Toaster Model 9 480.23
3    98d783a3      Fiction           Books    Fiction Model 5 900.10
4    91e54149      Fiction           Books    Fiction Model 7 472.77
5    40e96eae      Blender  Home & Kitchen    Blender Model 3 976.70
6    9c1abc4f       Jacket        Clothing     Jacket Model 4 833.65
7    c7b9d439      T-Shirt        Clothing    T-Shirt Model 4 977.64
8    9683342d       Jacket        Clothing    Jacket Model 10 144.09
9    0510d995      Toaster  Home & Kitchen   Toaster Model 10 996.15
10   468b8e4e        Jeans        Clothing      Jeans Model 6 149.04
11   77df5601    Biography           Books  Biography Model 7 104.37
12   e226de80     Lipstick          Beauty   Lipstick Model 4 401.31

    quantity  order_date delivery_date    payment_method  rating
0          4  2024-06-23    2023-11-13       Net Banking       5
1          3  2023-09-19    2023-05-26  Cash on Delivery       1
2          4  2025-02-07    2024-03-04        Debit Card       4
3          1  2024-06-12    2024-06-08        Debit Card       1
4          1  2023-05-07    2025-03-24        Debit Card       5
5          3  2025-03-03    2023-08-23               UPI       4
6          2  2024-04-08    2023-08-26  Cash on Delivery       2
7          5  2024-09-09    2024-03-24               UPI       4
8          3  2024-03-20    2024-12-24  Cash on Delivery       4
9          2  2024-09-30    2024-04-15       Credit Card       2
10         4  2024-02-23    2024-11-17       Net Banking       2
11         5  2023-06-12    2023-12-05       Credit Card       1
12         2  2023-07-25    2024-01-09        Debit Card       1

In [36]:
# 6.Find the total revenue generated (Price * Quantity).
query = """
SELECT SUM(quantity*price) AS total_revenue FROM amazon;
"""
df = pd.read_sql(query, engine)
print(df)

   total_revenue
0   1,494,242.92

In [37]:
# 7.Get the top 5 most purchased products by quantity.
query = """
SELECT * FROM amazon ORDER BY quantity DESC LIMIT 5;
"""
df = pd.read_sql(query, engine)
print(df)

   order_id customer_id    customer_name  gender  age  \
0  6a8728fc    f34ff913  Rebecca Rowland   Other   43
1  b3f6fcbf    2ef393a4   Melvin Johnson   Other   38
2  7c29d4f9    2dbb2113    George Turner    Male   47
3  f333e4b7    d4878af2   Michael Harper   Other   63
4  4e716e13    99c84d83   Joshua Krueger  Female   62

                        email         city         state country product_id  \
0  penapaul@wright-green.info    New Molly       Arizona     USA   4b9832db
1  michellehughes@hotmail.com    Jacobland   Mississippi     USA   4edf1b7d
2       mjennings@hotmail.com  New Randall       Wyoming     USA   6221cad5
3    molinajoel@hernandez.net   Bensonview  Pennsylvania     USA   26c133ec
4       melissa45@hotmail.com  Duncanburgh  North Dakota     USA   e6e329ac

  product_name  category       sub_category  price  quantity  order_date  \
0        Shoes  Clothing      Shoes Model 2 148.32         5  2025-01-01
1      Fiction     Books    Fiction Model 9 730.10         5  2024-08-28
2     Lipstick    Beauty   Lipstick Model 4 326.15         5  2024-10-16
3    Biography     Books  Biography Model 5 524.44         5  2024-10-02
4      T-Shirt  Clothing    T-Shirt Model 8 631.23         5  2023-06-01

  delivery_date    payment_method  rating
0    2024-08-13        Debit Card       2
1    2024-05-29  Cash on Delivery       1
2    2025-02-17       Net Banking       3
3    2023-06-03               UPI       3
4    2023-09-04       Credit Card       3

In [38]:
# 8.Find the number of orders placed per city.
query = """
SELECT city, COUNT(order_id) AS total_orders FROM amazon GROUP by city;
"""
df = pd.read_sql(query, engine)
print(df)

                  city  total_orders
0            East Mark             2
1     Christopherhaven             2
2          Port Daniel             1
3    North Michaelbury             1
4         Cynthiahaven             1
..                 ...           ...
951       North Kendra             1
952         Collinston             1
953         East Steve             1
954           Eddieton             1
955        Lake Kelsey             1

[956 rows x 2 columns]

In [39]:
# 9.Retrieve all orders where the rating is below 3.

query = """
SELECT * FROM amazon
WHERE rating <=3;
"""
df = pd.read_sql(query, engine)
print(df)

     order_id customer_id     customer_name gender  age  \
0    dee15a50    d9098344      Melissa Long   Male   40
1    07bd779e    be9e8d15  Christine Guzman   Male   43
2    f52cb099    bf06c8a5     Veronica Bass   Male   61
3    8d2d3abc    850dfded      Jason Cannon   Male   44
4    fc01e1a7    c9567f43   Danielle Warren  Other   23
..        ...         ...               ...    ...  ...
610  d2478f99    de37881b       Megan Adams  Other   34
611  ac994e1c    5c042249  Melissa Campbell   Male   38
612  cb0e3a9b    dc845f8d       Alexa Terry  Other   63
613  44f26e5b    ecd6e53b    Breanna Miller   Male   42
614  a73aa5b5    16ceb344      Robin Tanner   Male   31

                               email                city           state  \
0                  jacob94@jones.com  New Williamborough         Wyoming
1                  qstewart@ross.com          Port Devon        Nebraska
2    russellstephen@santos-watts.com   South Rhondamouth        Colorado
3       holly52@johnson-campbell.com          Port Sarah        Colorado
4            adamsdavid@villegas.com          West April  South Carolina
..                               ...                 ...             ...
610             laurie68@hotmail.com        Richardsbury    South Dakota
611              felicia03@yahoo.com         West Sherri         Alabama
612             benjamin86@yahoo.com          Dustinfurt            Ohio
613              troysalas@yahoo.com          New Andrea         Indiana
614   michaellivingston@jennings.com          Caseyburgh        Colorado

    country product_id product_name        category        sub_category  \
0       USA   59bc1024      Perfume          Beauty     Perfume Model 1
1       USA   d7fea14e      T-Shirt        Clothing     T-Shirt Model 8
2       USA   5bca2d89      T-Shirt        Clothing     T-Shirt Model 8
3       USA   56ff47e7    Biography           Books   Biography Model 4
4       USA   49d64d94        Shoes        Clothing       Shoes Model 6
..      ...        ...          ...             ...                 ...
610     USA   612ae7c9      Toaster  Home & Kitchen     Toaster Model 6
611     USA   fd1c7cb3       Tablet     Electronics     Tablet Model 10
612     USA   1c84ed0b      Toaster  Home & Kitchen     Toaster Model 5
613     USA   0bc98bc1      Shampoo          Beauty     Shampoo Model 7
614     USA   760741cf   Smartphone     Electronics  Smartphone Model 9

     price  quantity  order_date delivery_date    payment_method  rating
0    47.67         4  2025-03-05    2024-04-04       Credit Card       3
1    57.54         1  2024-01-26    2025-01-07        Debit Card       1
2   938.48         4  2023-12-05    2024-06-10        Debit Card       2
3   942.32         1  2025-02-26    2024-08-26  Cash on Delivery       2
4   716.49         2  2024-10-16    2024-05-07       Net Banking       1
..     ...       ...         ...           ...               ...     ...
610 135.78         1  2024-10-19    2023-08-02               UPI       1
611 348.31         3  2025-01-20    2024-06-20       Net Banking       1
612 435.39         3  2023-07-22    2025-03-05               UPI       1
613 208.63         3  2025-02-06    2024-03-31               UPI       3
614 232.40         3  2024-05-24    2024-03-17  Cash on Delivery       1

[615 rows x 19 columns]

In [40]:
# 10.Find the average price of products in each category.


query = """
SELECT category, AVG(price) AS average_price FROM amazon GROUP BY category;
"""
df = pd.read_sql(query, engine)
print(df)

         category  average_price
0     Electronics         469.26
1  Home & Kitchen         504.30
2        Clothing         528.07
3           Books         498.77
4          Beauty         514.30

In [41]:
# 11.Identify the month with the highest sales revenue.
query = """
SELECT EXTRACT(MONTH FROM order_date) AS month,
SUM(price * quantity) AS total_revenue
FROM amazon
GROUP BY month 
ORDER BY total_revenue DESC
LIMIT 1;
"""
df = pd.read_sql(query, engine)
print(df)

   month  total_revenue
0   7.00     159,649.35

In [42]:
# 12.Find the most popular product category based on the number of orders.
query = """
SELECT category, 
SUM(quantity) AS total_quantity FROM amazon 
GROUP BY category 
ORDER BY total_quantity 
DESC LIMIT 1;
"""
df = pd.read_sql(query, engine)
print(df)

         category  total_quantity
0  Home & Kitchen             638

In [43]:
# 13.Calculate the time difference (in days) between order date and delivery date for each order.
query = """
SELECT order_id, (delivery_date - order_date) AS delivery_time_in_days  
FROM amazon;
"""
df = pd.read_sql(query, engine)
print(df)

     order_id  delivery_time_in_days
0    532b3f3e                   -240
1    dee15a50                   -335
2    07bd779e                    347
3    f52cb099                    188
4    8d2d3abc                   -184
..        ...                    ...
995  ac994e1c                   -214
996  cb0e3a9b                    592
997  997c80b4                   -152
998  44f26e5b                   -312
999  a73aa5b5                    -68

[1000 rows x 2 columns]

In [44]:
# 14.Get the top 3 customers who spent the most money.
query = """
SELECT customer_id, customer_name, 
SUM(price*quantity) AS total_spend FROM amazon 
GROUP BY customer_id, customer_name 
ORDER BY total_spend DESC;
"""
df = pd.read_sql(query, engine)
print(df)

    customer_id       customer_name  total_spend
0      76bf5628       Ronald Martin     4,888.20
1      747472ce       Laurie Foster     4,812.60
2      03634a21    Brittney Beltran     4,807.55
3      61cda70d    Christopher Levy     4,807.30
4      d61f51be  Dr. Robert Gray MD     4,783.95
..          ...                 ...          ...
995    5c0eb179      Tracie Navarro        21.28
996    49412e1d       Jennifer Sims        20.81
997    4aa6fd92          John Mejia        20.21
998    cdf25241          Mary Casey        18.34
999    5b168f0e         Sean Austin        11.73

[1000 rows x 3 columns]

In [45]:
# 15.Find the percentage of total sales contributed by each product category.
query = """
SELECT product_name,  
ROUND(SUM(price * quantity) * 100.0 / (SELECT SUM(price * quantity) FROM amazon), 2) AS revenue_percentage  
FROM amazon  
GROUP BY product_name  
ORDER BY revenue_percentage DESC;
"""
df = pd.read_sql(query, engine)
print(df)

      product_name  revenue_percentage
0        Microwave                5.43
1        Biography                4.92
2      Non-Fiction                4.91
3      Body Lotion                4.87
4           Laptop                4.83
5            Jeans                4.80
6           Jacket                4.53
7          Blender                4.33
8   Vacuum Cleaner                4.29
9       Headphones                4.23
10         Toaster                4.16
11         Perfume                4.08
12      Smartphone                3.98
13          Tablet                3.91
14         Shampoo                3.82
15         Fiction                3.68
16    Coffee Maker                3.63
17         T-Shirt                3.56
18           Shoes                3.41
19      Smartwatch                3.27
20      Face Cream                3.19
21          Comics                3.14
22     Educational                3.07
23         Sweater                3.05
24        Lipstick                2.91